Revit 2026 API

# ViewScheduleCreateKeynoteLegend Method

---

Creates a keynote legend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ViewSchedule CreateKeynoteLegend(
	Document document
)
```
```vb
Public Shared Function CreateKeynoteLegend (
	document As Document
) As ViewSchedule
```
```cpp
public:
static ViewSchedule^ CreateKeynoteLegend(
	Document^ document
)
```
```fsharp
static member CreateKeynoteLegend :
        document : Document -> ViewSchedule
```

#### Parameters

document Document
     The document to which the new schedule will be added.

#### Return Value

ViewSchedule The newly created schedule.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non-optional argument was null |
| ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

A keynote legend is a schedule of the Keynote Tags category.

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace